app/controllers/collections_controller.rb

  def create
    @collection = current_user.collections.build(collection_params)
    @collection.save
    last_id = Collection.maximum('id')
    @domains = Website.where(:user_id => current_user)
    @domains.where("collection_id IS ?", nil).update( collection_id: last_id )
---
INSERT INTO "collections" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rubyonrails"], ["user_id", 1], ["created_at", 2016-11-23 06:58:16 UTC], ["updated_at", 2016-11-23 06:58:16 UTC]]
SELECT  "collections".* FROM "collections" ORDER BY "collections"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT MAX("collections"."id") FROM "collections"
SELECT "websites".* FROM "websites" WHERE "websites"."user_id" = 1 AND (collection_id IS NULL)
UPDATE "websites" SET "collection_id" = ?, "updated_at" = ? WHERE "websites"."id" = ?  [["collection_id", 25], ["updated_at", 2016-11-27 16:01:24 UTC], ["id", 31]]