app/controllers/static_pages_controller.rb

SELECT "websites".* FROM "websites" WHERE "websites"."user_id" = ?  [["user_id", 1]]
INSERT INTO "alexaranks" ("rank", "website_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rank", 0], ["website_id", 38], ["created_at", 2016-11-28 06:50:51 UTC], ["updated_at", 2016-11-28 06:50:51 UTC]]
---
  def show
    web = Website.where(user_id: current_user.id)
    @alexa_rank_json = StaticPagesHelper.createJSON(web)